---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.GetIntermediateColors
source: html/818e8cde-fa1e-72c2-ecc4-b203ce967eb4.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.GetIntermediateColors Method

Get intermediate color entries (other than the minimum and maximum settings).

## Syntax (C#)
```csharp
public IList<AnalysisDisplayColorEntry> GetIntermediateColors()
```

## Returns
Array of intermediate color entries.